Server_Code/app/controllers/friendships_controller.rb

  def index
    @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"

  def new
    @user=current_user
    friend=User.find_by_email(params[:email])

    if(friend)
      friendCheck=Friendship.find_by_user_id_and_friend_id(@user.id, friend.id)
      if(!friendCheck)
        @friendship = @user.friendships.build(:friend_id => friend.id)

        respond_to do |format|
          if @friendship.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'wagnerj5@apps.tcnj.edu' LIMIT 1
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 9 AND "friendships"."friend_id" = 6 LIMIT 1
INSERT INTO "friendships" ("created_at", "friend_id", "type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 28 Apr 2013 22:45:50 UTC +00:00], ["friend_id", 5], ["type", "PendingFriendship"], ["updated_at", Sun, 28 Apr 2013 22:45:50 UTC +00:00], ["user_id", 3]]

  def edit
    @friendship = Friendship.find(params[:id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", "9"]]

  def create
    @user=current_user
    friend=User.find_by_email(params[:email])
    if(friend)
      friendCheck=Friendship.find_by_user_id_and_friend_id(@user.id, friend.id)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 2 AND "friendships"."friend_id" = 3 LIMIT 1

  def create
    @user=User.find(params[:uid])
    friend=User.find(params[:fid])
    if(friend && @user)
      friendShip=Friendship.find_by_user_id_and_friend_id(@user.id, friend.id)
      if(friendShip)
        friendShip.type='ConfirmedFriendship'
        respond_to do |format|
          if friendShip.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
UPDATE "friendships" SET "type" = 'ConfirmedFriendship', "updated_at" = '2013-04-28 23:38:01.755314' WHERE "friendships"."type" IN ('PendingFriendship') AND "friendships"."id" = 8

  def update
    @friendship = Friendship.find(params[:id])

    respond_to do |format|
      if @friendship.update_attributes(params[:friendship])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "friendships" SET "user_id" = 10, "updated_at" = '2013-04-26 22:25:30.252701' WHERE "friendships"."id" = 1

  def destroy
    @user=current_user
    friend = User.find_by_email(Params[:email])
    if(friend)
      friendCheck=Friendship.find_by_user_id_and_friend_id(@user.id, friend.id)
      if(friendCheck)
        @friendship = @user.friendships.find_by_friend_id(friend.id)
        @friendship.destroy
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'wagnerj5@apps.tcnj.edu' LIMIT 1
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 3 AND "friendships"."friend_id" = 3 LIMIT 1
DELETE FROM "friendships" WHERE "friendships"."type" IN ('ConfirmedFriendship') AND "friendships"."id" = ?  [["id", 1]]