Server_Code/app/controllers/moments_controller.rb

  def edit
    @user = User.find(session[:user_id])
    if(@user)
      @user.latitude = params[:latitude]
      @user.longitude = params[:longitude]
      @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "latitude" = 1.0, "longitude" = 2.0, "updated_at" = '2013-04-12 02:37:44.576879' WHERE "users"."id" = 1