Server_Code/app/controllers/users_controller.rb

  def show
    #@user = User.find(session[:user_id])
    @user = current_user

    respond_to do |format|
      format.html # show.html.erb
      format.json { render json: User.all }
---
SELECT "users".* FROM "users"