Server_Code/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.create_api_key
---
INSERT INTO "api_keys" ("access_token", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["access_token", "cf2e0e4a5483070c287e2655a294347e"], ["created_at", Fri, 12 Apr 2013 03:45:53 UTC +00:00], ["updated_at", Fri, 12 Apr 2013 03:45:53 UTC +00:00], ["user_id", nil]]
INSERT INTO "users" ("created_at", "email", "latitude", "longitude", "message", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "password_digest" = '$2a$10$dBfPYpK3A5n0s.CKss.0k.kuSBRLBJQw.0gkDrbBJ2ggiMHkxuQW6', "updated_at" = '2013-04-14 18:40:03.682006' WHERE "users"."id" = 2